import random

SP_M = ("Иванов", "Смирнов", "Кузнецов", "Попов", "Васильев", "Петров", "Соколов", "Михайлов", "Новиков", "Фёдоров")
SP_D = ("Морозов", "Волков", "Алексеев", "Лебедев", "Семёнов", "Егоров", "Павлов", "Козлов", "Степанов", "Николаев")

lst = list(SP_M)
lst_2 = list(SP_D)
random.shuffle(lst)
random.shuffle(lst_2)
SP_MS = tuple(lst)
SP_DS = tuple(lst_2)

CM = SP_MS[:5] + SP_DS[:5]

CM_SR = tuple(sorted(CM))

print("Состав команды:", *CM,
"\nМоя группа:",*SP_M,
"\nДругая группа:",*SP_D,
"\n\nДлина кортежа:", len(CM),
"\n\nОтсортированный кортеж:", *CM_SR
      )

if "Иванов" in CM:
      print("\nИванов входит в команду")
else:
      print("\nИванов не входит в команду")
